package javatr.task5.runner;
//5. Составить программу, печатающую значение true, если указанное высказывание является истинным, и
//false — в противном случае: является ли целое число совершенным (сумма делителей равна самому
//числу).
public class Main {
    public static void main(String[] args) {
        System.out.println("aaa");
    }
}
